[
    {
        "targetWord": "Taint",
        "errorMessage": "Data flow analysis detected possible source of taint",
        "messageTranslation": "データフロー解析により汚染の可能性のあるソースが検出されました",
        "generalMeaning": "【動】汚す、汚染する、傷つける",
        "generalExample": "His reputation was tainted by scandal (彼の評判はスキャンダルによって汚された)",
        "techMeaning": "外部から入ってきたデータが「信用できない印」をつけられている状態。セキュリティ的に危険な可能性があるよ、と警告している。",
        "explanation": "ユーザー入力や外部APIからのデータは「不潔なデータ（Taint）」として扱うのが原則。そのままデータベースに入れたり画面に出力したりすると、SQLインジェクションやXSSの原因になる。入力は必ずサニタイズ（消毒）しよう！",
        "usageContext": "信頼していた情報源が間違っていた時",
        "usageExample": "I realized the whole report was tainted by misleading data.",
        "usageExampleTranslation": "レポート全体が誤解を招くデータによって汚染されていることに気づいた。",
        "usagePunchline": "Security Team: This input is highly 406 Not Acceptable.",
        "usagePunchlineTranslation": "セキュリティチーム：この入力は非常に危険で受け入れられない（406）。"
    },
    {
        "targetWord": "Overload",
        "errorMessage": "HTTP 503 Service Unavailable (Server Overload)",
        "messageTranslation": "サービス利用不可（サーバー過負荷）",
        "generalMeaning": "【動】過負荷をかける、詰め込みすぎる",
        "generalExample": "Don't overload the washing machine. (洗濯機に詰め込みすぎるな。)",
        "techMeaning": "サーバーが「もう無理！限界！」と悲鳴を上げている状態。キャパシティを超えたアクセスで処理が麻痺している。",
        "explanation": "プログラムが同時に処理できる量を超えたときに発生します。ダイエット中の胃袋に焼き肉を無理やり詰め込むようなもの。急にアクセスが増えたら、サーバーを増やしたり（スケールアウト）、処理能力を上げる（スケールアップ）ことを検討しましょう。",
        "usageContext": "忙しい友人に頼みごとをする時",
        "usageExample": "I don't want to overload you with too many tasks.",
        "usageExampleTranslation": "君にあまりにも多くのタスクを押し付けたくない。",
        "usagePunchline": "Friend: My queue is full. Status 429 Too Many Requests!",
        "usagePunchlineTranslation": "友人：僕のキューは満杯だよ。ステータス 429 リクエスト過多！"
    },
    {
        "targetWord": "Redacted",
        "errorMessage": "Log file (Sensitive data redacted)",
        "messageTranslation": "ログファイル（機密データは編集・削除済み）",
        "generalMeaning": "【動】編集する、削除する、検閲する（特に機密情報を黒塗りして公開すること）",
        "generalExample": "The document was heavily redacted before release. (その文書は公開前に大幅に黒塗りされた。)",
        "techMeaning": "セキュリティやプライバシー保護のため、ログや表示から「黒塗り」された情報。見せたくないから消したわけではなく、ユーザーを守っているのだ。",
        "explanation": "ユーザーパスワードやAPIキーなど、絶対に公開してはいけない情報が漏れないように伏せ字にすること。もし必要な情報がRedactedされていたら、表示するための権限や設定を見直す必要があります。",
        "usageContext": "秘密をバラされたくない時",
        "usageExample": "The details of my weekend plan are redacted.",
        "usageExampleTranslation": "週末の計画の詳細は、黒塗り（秘密）です。",
        "usagePunchline": "Friend: But I found the SQL injection vulnerability!",
        "usagePunchlineTranslation": "友人：でも、SQLインジェクションの脆弱性を見つけたぞ！"
    },
    {
        "targetWord": "Unwrap",
        "errorMessage": "fatal error: unexpectedly found nil while unwrapping an Optional value",
        "messageTranslation": "致命的なエラー：Optional値を開封する際に予期せずnilが見つかりました",
        "generalMeaning": "【動】包みを開ける、解く",
        "generalExample": "Unwrap the gift carefully. (注意深くプレゼントの包みを開けなさい。)",
        "techMeaning": "値が入っているか保証されていない箱（Optional型）を、中身を確認せずに力ずくで開けてしまう操作。箱の中が空っぽ（nil）だとプログラムがクラッシュする原因。",
        "explanation": "SwiftやRustなど、安全性を重視する言語でよく見るエラー。Unwrapは「絶対に入っているはず！」という確信犯的な開封です。中身がnilだったら、即座にSegmentation Fault!（メモリ破壊エラー）になります。",
        "usageContext": "期待外れのプレゼントを開ける時",
        "usageExample": "I was excited to unwrap the package, but it was just socks.",
        "usageExampleTranslation": "パッケージを開けるのが楽しみだったのに、ただの靴下だった。",
        "usagePunchline": "Me: That's a huge nil pointer dereference!",
        "usagePunchlineTranslation": "私：それはひどいnilポインタ参照解除だよ！（クラッシュ確定）"
    },
    {
        "targetWord": "Reconfigure",
        "errorMessage": "System needs to reconfigure firewall settings.",
        "messageTranslation": "システムはファイアウォールの設定を再構成する必要があります。",
        "generalMeaning": "【動】再構成する、設定し直す",
        "generalExample": "We need to reconfigure the office layout. (オフィスの配置を再構成する必要がある。)",
        "techMeaning": "今の設定ではうまく動かないから、一度システムを停止するか、設定をやり直すこと。大体、環境が変わったときや、セキュリティ要件が変わったときに要求される。",
        "explanation": "プログラムやサーバーが「ちょっと待って、頭の中を整理させて！」と言っているようなもの。このメッセージが出たら、ドキュメントを読みながら慎重に設定ファイルを見直しましょう。急いで適当にやると、余計な穴（セキュリティホール）を開けることになります。",
        "usageContext": "計画が大幅に狂った時",
        "usageExample": "Our weekend trip plan failed, so we have to reconfigure.",
        "usageExampleTranslation": "週末の旅行計画がダメになったから、再構成しないといけない。",
        "usagePunchline": "Boss: Make sure to apply the changes without downtime! (Zero-downtime deployment!)",
        "usagePunchlineTranslation": "上司：停止時間なしで変更を適用しろよ！（無停止デプロイ！）"
    },
    {
        "targetWord": "Degenerate",
        "errorMessage": "The matrix has become degenerate; calculation failed.",
        "messageTranslation": "行列が特異値分解不能になりました（退化しました）。計算に失敗しました。",
        "generalMeaning": "【動】退化する、堕落する、衰える",
        "generalExample": "His moral standards began to degenerate. (彼の道徳基準は堕落し始めた。)",
        "techMeaning": "数値計算やアルゴリズムにおいて、システムが「悪い状態」に陥り、数学的に破綻したり、意味のない結果しか出せなくなった状態。特に機械学習や線形代数で聞く、最悪のパターン。",
        "explanation": "プログラムが段々とポンコツになっていくイメージ。計算上のゼロ割や無限大のような状態を引き起こす前に、エラーとして警告されます。入力データが偏りすぎていたり、変な値が入っていると起こりやすいです。",
        "usageContext": "長期休暇明けの自分を見た時",
        "usageExample": "After a week of vacation, my productivity tends to degenerate.",
        "usageExampleTranslation": "1週間の休暇の後、私の生産性は退化しがちだ。",
        "usagePunchline": "Project Manager: Your code quality is suffering from serious entropy!",
        "usagePunchlineTranslation": "PM：君のコードの質は深刻なエントロピー（無秩序）に苦しんでいるぞ！"
    },
    {
        "targetWord": "Stall",
        "errorMessage": "Request stalled due to resource contention.",
        "messageTranslation": "リソース競合によりリクエストが停止しました。",
        "generalMeaning": "【動】失速する、停止する、時間稼ぎをする",
        "generalExample": "The car stalled on the hill. (車が坂道でエンストした。)",
        "techMeaning": "プログラムが「ちょっと待ってて！」と言って、フリーズ状態になっていること。特にリソースの奪い合いで起きる。",
        "explanation": "信号待ちで次の処理に進めない状態。原因はメモリ不足やロックの取り合いが多い。コーヒーブレイクをして待つのも手だが、無限ループの可能性もあるのでログを確認しよう。",
        "usageContext": "友達が約束の時間になっても家から出てこない時。",
        "usageExample": "Stop stalling! We are going to be late!",
        "usageExampleTranslation": "ウジウジしないで！遅刻するよ！",
        "usagePunchline": "Friend: My commit failed, status 418 I'm a teapot.",
        "usagePunchlineTranslation": "友人：コミットに失敗した、ステータス418 僕はティーポットだよ（機能しない）"
    },
    {
        "targetWord": "Yield",
        "errorMessage": "Generator cannot yield outside of function body.",
        "messageTranslation": "ジェネレータは関数本体の外で値を生成（譲渡）できません。",
        "generalMeaning": "【動】産出する、屈する、道を譲る",
        "generalExample": "The field yields a rich harvest. (その畑は豊かな収穫をもたらす。)",
        "techMeaning": "「一旦停止して、今の結果を渡すよ。でも処理自体は終わらせないよ」とプログラムが区切りをつけること。休憩を挟んで結果を返す賢い奴。",
        "explanation": "普通の関数は処理が終わるまで結果を返さないが、これは途中で結果を小出しにできる機能。行列処理や無限データセットを扱うときにメモリを節約できる。急いでいる時は向かないかも。",
        "usageContext": "会社の飲み会で、上司に話の主導権を譲る時。",
        "usageExample": "I decided to yield the floor to the CEO.",
        "usageExampleTranslation": "私はCEOに話す場を譲ることにしました。",
        "usagePunchline": "CEO: Okay, 204 No Content.",
        "usagePunchlineTranslation": "CEO：よし、204 コンテンツなし。（もう話すことはない）"
    },
    {
        "targetWord": "Concatenate",
        "errorMessage": "Cannot concatenate 'str' and 'int' objects.",
        "messageTranslation": "'str'（文字列）と 'int'（整数）のオブジェクトを連結できません。",
        "generalMeaning": "【動】連結する、鎖状につなぐ",
        "generalExample": "Concatenate two lists into one. (2つのリストを1つに連結する。)",
        "techMeaning": "複数の文字列やデータを、一つの一本鎖のソーセージのようにくっつける作業。エラーになるのは、リンゴとバナナをそのままつなげようとする時。",
        "explanation": "プログラミングにおけるデータ型の結婚。型が揃っていないと「それは無理だよ」とエラーを吐かれる。文字列にするなら全部文字列にしてから連結しよう。まずは型合わせが大事。",
        "usageContext": "料理で、全然合わない食材を無理やり混ぜようとする時。",
        "usageExample": "I tried to concatenate spicy curry and ice cream.",
        "usageExampleTranslation": "私はスパイシーなカレーとアイスクリームを連結（混ぜよう）しました。",
        "usagePunchline": "Result: 400 Bad Request.",
        "usagePunchlineTranslation": "結果：400 不正なリクエスト。（味がひどすぎる）"
    },
    {
        "targetWord": "Residue",
        "errorMessage": "Residual data detected in the allocated memory block.",
        "messageTranslation": "割り当てられたメモリブロックに残存データが検出されました。",
        "generalMeaning": "【名】残渣、残留物、残り",
        "generalExample": "There was an oily residue left in the pan. (フライパンに油の残留物が残っていた。)",
        "techMeaning": "昔使ったデータがメモリの片隅にゴミとして残っている状態。「前使ってた人の痕跡が残っちゃったよ」というちょっと気持ち悪い状態。",
        "explanation": "部屋を掃除せずに次の人が使い始めたら、前の住人の食べ残しが残っていたようなもの。セキュリティ上も問題になることがあるので、きっちり初期化（掃除）をしてから使おう。",
        "usageContext": "友達が急に引っ越した後の、冷蔵庫の中。",
        "usageExample": "We found some strange residue in the fridge after they left.",
        "usageExampleTranslation": "彼らが引っ越した後、冷蔵庫に変な残留物を見つけた。",
        "usagePunchline": "Security Guard: 401 Unauthorized",
        "usagePunchlineTranslation": "警備員：401 認証されていません（誰のゴミだかわからない）"
    },
    {
        "targetWord": "Bypass",
        "errorMessage": "Security policy violation: attempted bypass of access control.",
        "messageTranslation": "セキュリティポリシー違反：アクセス制御の迂回が試行されました。",
        "generalMeaning": "【動】迂回する、回り道をする、無視して通る",
        "generalExample": "We took the bypass road to avoid traffic. (交通渋滞を避けるためにバイパス道路を使った。)",
        "techMeaning": "ルールを無視して最短距離を突破しようとする行為。セキュリティやアクセス制限をこっそり飛び越えようとする、ちょっと悪い子のプログラム。",
        "explanation": "プログラムの正規ルート（設計された流れ）を無視して、抜け道や裏口を使おうとすると出るエラー。セキュリティ上は大問題。悪いハッカーがよく使う手口なので、自分のプログラムでは迂回できないようにしっかりガードしよう。",
        "usageContext": "会社のセキュリティを破って、社員食堂のおかわり自由のルールを無視しようとする時。",
        "usageExample": "He tried to bypass the security check to get extra desserts.",
        "usageExampleTranslation": "彼は追加のデザートをもらうために、セキュリティチェックを迂回しようとした。",
        "usagePunchline": "HR: Status 406 Not Acceptable",
        "usagePunchlineTranslation": "人事部：ステータス 406 受理できない（そんなに食べるのは許されない）"
    }
]